; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	infrared0 - mode
	infrared4 - mode
	thermograph2 - mode
	spectrograph1 - mode
	thermograph3 - mode
	spectrograph5 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation6 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	GroundStation5 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 infrared4)
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph5)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph5)
	(calibration_target instrument1 GroundStation6)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph3)
	(supports instrument2 spectrograph5)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument3 spectrograph1)
	(supports instrument3 infrared4)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation6)
	(supports instrument4 thermograph2)
	(supports instrument4 infrared4)
	(calibration_target instrument4 GroundStation4)
	(supports instrument5 infrared0)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 GroundStation5)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
)
(:goal (and
	(pointing satellite0 GroundStation3)
	(have_image Planet7 thermograph3)
	(have_image Planet7 thermograph2)
	(have_image Phenomenon8 spectrograph5)
	(have_image Star9 spectrograph1)
	(have_image Star9 spectrograph5)
	(have_image Star10 thermograph3)
	(have_image Phenomenon11 infrared0)
	(have_image Planet12 infrared4)
	(have_image Planet12 spectrograph1)
))

)

; plan
1. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 10
2. (calibrate satellite2 instrument5 groundstation1)
   added: (calibrated instrument5)
   goals met: 0 of 10
3. (turn_to satellite2 planet7 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 planet7)
   goals met: 0 of 10
4. (take_image satellite2 planet7 instrument5 thermograph2)
   added: (have_image planet7 thermograph2)
   goals met: 1 of 10
5. (turn_to satellite2 phenomenon11 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 phenomenon11)
   goals met: 1 of 10
6. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 10
7. (calibrate satellite1 instrument3 groundstation6)
   added: (calibrated instrument3)
   goals met: 1 of 10
8. (turn_to satellite1 planet12 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 planet12)
   goals met: 1 of 10
9. (turn_to satellite0 groundstation3 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation3)
   goals met: 2 of 10
10. (take_image satellite1 planet12 instrument3 spectrograph1)
   added: (have_image planet12 spectrograph1)
   goals met: 3 of 10
11. (take_image satellite1 planet12 instrument3 infrared4)
   added: (have_image planet12 infrared4)
   goals met: 4 of 10
12. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 4 of 10
13. (calibrate satellite0 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 4 of 10
14. (take_image satellite2 phenomenon11 instrument5 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 5 of 10
15. (turn_to satellite0 phenomenon8 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 10
16. (take_image satellite0 phenomenon8 instrument2 spectrograph5)
   added: (have_image phenomenon8 spectrograph5)
   goals met: 5 of 10
17. (turn_to satellite0 planet7 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet7)
   goals met: 5 of 10
18. (take_image satellite0 planet7 instrument2 thermograph3)
   added: (have_image planet7 thermograph3)
   goals met: 6 of 10
19. (turn_to satellite0 star10 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star10)
   goals met: 6 of 10
20. (take_image satellite0 star10 instrument2 thermograph3)
   added: (have_image star10 thermograph3)
   goals met: 7 of 10
21. (turn_to satellite0 star9 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star9)
   goals met: 7 of 10
22. (take_image satellite0 star9 instrument2 spectrograph5)
   added: (have_image star9 spectrograph5)
   goals met: 8 of 10
23. (turn_to satellite0 groundstation3 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation3)
   goals met: 9 of 10
24. (turn_to satellite1 star9 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 star9)
   goals met: 9 of 10
25. (take_image satellite1 star9 instrument3 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 10 of 10
